<template>
    <v-timeline align-top dense class="mr-md-10">
        <v-timeline-item v-for="point in points" :key="point.time" fill-dot right>
            <span slot="opposite">{{ point.time }}</span>
            <v-card class="elevation-2">
                <v-card-title class="headline">{{ point.time }}</v-card-title>
                <v-card-text v-html="point.description" class="text-left">
                </v-card-text>
            </v-card>
        </v-timeline-item>
    </v-timeline>
</template>

<script>
export default {
    name: 'History',
    computed: {
        points () {
            return [
                {
                    time: '1997',
                    description: '旧駒場寮の廃寮に伴い、駒場小劇場および旧寮食堂南ホールが廃止に。<br>その代替施設として、駒場小空間が建設開始。'
                },
                {
                    time: '1998',
                    description: '７月、完成。柿落としとして、教養学部主催「書物」、小鳥クロックワーク「てれびはぼくをだめにする」が行われる。<br>' +
                        'この頃より旧北ホール委員会と学生課の間において非公式に協議の場がもたれ､ 運営のあり方などについて意見交換が行われる。<br>' +
                        '第１回運営協議会が行われ､多目的ホール使用細則の作成が求められる。<br>' +
                        'その後、旧北ホール委員会のメンバーを中心に多目的ホール総務部が仮発足し、使用細則の作成にあたる。１１月､多目的ホール使用細則が運営協議会の承認を得て施行される。<br>' +
                        '第１回多目的ホール使用団体連絡会議が開催され､総務部の承認､今後の運営方針等について 話し合われる。この頃､総務部の要望により追加の機材を購入。総務部で多目的ホールの通称を募集､｢駒場小空間」という名称に落ち着く。 その後､大きな事故もなく現在にいたる。'
                },
                {
                    time: '現在',
                    description: '駒場小空間は東大駒場キャンパスの生協の前の道をまっすぐ行って生協書籍部の奥にある 鉄筋コンクリート立ての(名前に反して）大きな建物です。 内部は縦､横１６.５メートル､高さ７メートルのがらんとした直方体の空間になっています。 全体は３階建てですが､劇場部分は３階まで吹き抜けになっていて、 2階にあたるギャラリー､調光室､３階にあたるキャットウォーク間で階段が続いています。 1階には劇場のほかにロビー､楽屋､空調室､トイレ､倉庫などがあり､この建物のみで きちんと劇場の機能を果たすことが出来ます。 内部は常設の舞台や客席などがなく､平らな床があるだけなので 通常は練習用のスペースとして使用できます。 公演時には１００枚ほどある平台などを利用して客席を組み､終わったらばらしてしまいます。 その他燈体､調光卓､スピーカー､アンプ､各種デッキ､ミキサー､ワイヤレスマイクなど、充実した機材が利用できます。    *'
                }
            ]
        }
    }
}
/*
*
    １９９８年
     ７月、完成。柿落としとして教養学部主催｢書物｣､小鳥クロックワーク「てれびはぼくをだめにする」 が行われる。 この頃より旧北ホール委員会と学生課の間において非公式に協議の場がもたれ､ 運営のあり方などについて意見交換が行われる。 ７月､第１回運営協議会が行われ､多目的ホール使用細則の作成が求められる。 その後、旧北ホール委員会のメンバーを中心に多目的ホール総務部が仮発足し、 使用細則の作成にあたる。 １１月､多目的ホール使用細則が運営協議会の承認を得て施行される。

     第１回多目的ホール使用団体連絡会議が開催され､総務部の承認､今後の運営方針等について 話し合われる。 この頃､総務部の要望により追加の機材を購入。 総務部で多目的ホールの通称を募集､｢駒場小空間」という名称に落ち着く。 その後､大きな事故もなく現在にいたる。

    現在
     駒場小空間は東大駒場キャンパスの生協の前の道をまっすぐ行って生協書籍部の奥にある 鉄筋コンクリート立ての(名前に反して）大きな建物です。 内部は縦､横１６.５メートル､高さ７メートルのがらんとした直方体の空間になっています。 全体は３階建てですが､劇場部分は３階まで吹き抜けになっていて、 2階にあたるギャラリー､調光室､３階にあたるキャットウォーク間で階段が続いています。 1階には劇場のほかにロビー､楽屋､空調室､トイレ､倉庫などがあり､この建物のみで きちんと劇場の機能を果たすことが出来ます。 内部は常設の舞台や客席などがなく､平らな床があるだけなので 通常は練習用のスペースとして使用できます。 公演時には１００枚ほどある平台などを利用して客席を組み､終わったらばらしてしまいます。 その他燈体､調光卓､スピーカー､アンプ､各種デッキ､ミキサー､ワイヤレスマイクなど、充実した機材が利用できます。    *
* */
</script>

<style scoped>

</style>
